Revit 2026 API

# DimensionTextPosition Property

---

The position of the dimension text's drag point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ TextPosition { get; set; }
```
```vb
Public Property TextPosition As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ TextPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member TextPosition : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | Thrown when: |

  * SpotDimension style type is SpotSlope.
  * Using equality formula.
  * Dimension style is ordinate.

-or- Thrown when:
  * SpotDimension has more than one segments.

-or-

This property is not applicable to all dimensions. For example, it is not available for spot slope dimensions, multi-segments dimensions, dimensions using equality formula, and when dimension style is ordinate.

If the position is not applicable, this property throws InvalidOperationException.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace